по необходимым параметрам подключаются таблицы, все условия соединяются через AND

функция для создания JOIN части sql запроса - join_search_tables(params)
функций для создания WHERE части sql запроса - join_search_conditions(conds)
функция для поиска заглавных слов по созданному запросу - search_query(tables, conditions)
функция для поиска текста для конкретного слова - load_page(word)
функция для поиска по жанрам источника - resource_genre(param)
на вход мы получаем список списков, где каждый элемент [имя_заполненного_поля, [значение]] или [имя_заполненного_поля, [значение_1, значение_2, и т.д.]] для параметров со множественным выбором имя_заполненного_поля состоит из имени общего параметра и конкретного признака. source_name = в источниках смотрим название example_date_start_y = в примерах смотрим раннюю дату в годах

join_search_tables(params)

имеет список соответствия общего параметра в названии условия поиска и конкретных таблиц, необходимых для поиска
в соответствии со списком добавляет необходимые таблицы без повторений
возвращает строку "JOIN.... JOIN..."
join_search_conditions(conds)

имеет список соответствия условия поиска и конкретного поискового запроса WHERE, учитывает множественность выбора
склеивает запросы в один
возвращает строку "WHERE ... AND ..."
search_query(search_tables, conditions)

склеивает все в один запрос и ищет
выдает список [head_word, head_word, head_word] без повторений, если встретились
load_page(word)

принимает конкретное слово head_word из списка, составленного ранее
возвращает список из full_text для слова
т.к. некоторые поиски состоят из нескольких, как поиск по жанру источника, такие поиски будут отдельной функцией resource_genre(param) - поиск по жанрам источников
